try:
    a = int(input('Коэффициент 1:'))
    b = int(input('Коэффициент 2:'))
    c = int(input('Коэффициент 3:'))
    try:
        d = b**2-4*a*c
        print('~~~~~~~~~~~~~~~~~~ОТВЕТ~~~~~~~~~~~~~~~~~~')
        if d<0: print('Комплексное число')
        if d==0:
            x1=-b/(2*a)
            print('Корень:',x1)
        else:
            x1=(-b+d**(1/2))/(2*a)
            x2 = (-b - d ** (1 / 2)) / (2 * a)
            print('Корни:',x1,x2)
        print('~~~~~~~~~~~~~~~~~~ОТВЕТ~~~~~~~~~~~~~~~~~~')
    except:
        print('ошибка')
except:
    print('ошибка')


